app/controllers/drawings_controller.rb

  def index
    @drawings = Drawing.all
---
SELECT "drawings".* FROM "drawings"

  def create
    @drawing = Drawing.new(drawing_params)

    respond_to do |format|
      if @drawing.save
---
INSERT INTO "drawings" ("created_at", "description", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 20 Feb 2014 16:05:27 UTC +00:00], ["description", "asdasd"], ["image", "imgLogoFafip.png"], ["name", "asda"], ["updated_at", Thu, 20 Feb 2014 16:05:27 UTC +00:00]]

  def update
    respond_to do |format|
      if @drawing.update(drawing_params)
---
UPDATE "drawings" SET "name" = ?, "updated_at" = ? WHERE "drawings"."id" = 3  [["name", "asdsdd"], ["updated_at", Thu, 20 Feb 2014 16:19:45 UTC +00:00]]

  def destroy
    @drawing.destroy
---
DELETE FROM "drawings" WHERE "drawings"."id" = ?  [["id", 1]]

    def set_drawing
      @drawing = Drawing.friendly.find(params[:id])
---
SELECT "drawings".* FROM "drawings" WHERE "drawings"."id" = ? LIMIT 1  [["id", "3"]]