app/controllers/mains_controller.rb

SELECT "mains".* FROM "mains" ORDER BY "mains"."id" DESC LIMIT 1
---
  def index
    @mains = Main.all

UPDATE "mains" SET "newscontent" = ?, "updated_at" = ? WHERE "mains"."id" = 1
---
  def update
    respond_to do |format|
      if @main.update(main_params)

SELECT "mains".* FROM "mains" WHERE "mains"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_main
      @main = Main.find(params[:id])